
-- 공지사항
-- 공지사항 번호, 제목, 내용, 날짜, 개설 과정 정보 번호

--set define off;

insert into tblNotice values (1, '오리엔테이션 안내', '내일 오후 5시에 오리엔테이션이 예정되어 있습니다.', '2022-05-19', 1);
insert into tblNotice values (2, '자바 강의 일정 안내', '자바 수업은 6월 22일까지 예정되어 있습니다.', '2022-05-23', 1);
insert into tblNotice values (3, '과제 제출 안내', '과제는 구글 드라이브에 자신의 이름으로 폴더 생성 후 업로드 바랍니다.', '2022-05-23', 1);
insert into tblNotice values (4, '코드 리뷰 안내', '코드 리뷰 방식에 대하여 웹페이지에 게시해놓았으니 확인하시길 바랍니다.', '2022-05-24', 1);
insert into tblNotice values (5, '코드 리뷰 팀 공지', '코드 리뷰 팀을 웹페이지에 게시해놓았으니 확인 바랍니다.', '2022-05-25', 1);
insert into tblNotice values (6, '자바 프로젝트 일정 안내', '6월 15일 ~ 21일까지 자바 프로젝트 진행 예정입니다.', '2022-06-10', 1);
insert into tblNotice values (7, '자바 시험 일정 안내', '내일 오후 2시에 자바 시험이 있으니 늦지 않게 참석바랍니다.', '2022-06-20', 1);
insert into tblNotice values (8, '자바스크립트 프로젝트 팀 공지', '자바스크립트 프로젝트 팀 구성을 웹페이지에 게시하였으니 확인 바랍니다.', '2022-07-14', 1);
insert into tblNotice values (9, '자바스크립트 시험시간 공지', '22일 오전에 자바스크립트 시험이 예정되어 있습니다.', '2022-07-17', 1);
insert into tblNotice values (10, '오라클 프로젝트 & 시험 일정', '오라클 프로젝트 기간은 8월 15일 ~ 19일까지이며, 22일은 오후에 시험이 있습니다.', '2022-08-11', 1);
insert into tblNotice values (11, '오라클 프로젝트 팀 공지', '오라클 프로젝트 팀 구성을 웹페이지에 게시해놓았으니 확인 바랍니다.', '2022-08-12', 1);
insert into tblNotice values (12, '네트워크 시험 일정 공지', '다음주 목요일 오전에 네트워크 시험이 있으니 늦지 않게 참여바랍니다.', '2022-09-17', 1);
insert into tblNotice values (13, '리눅스 시험 일정 공지', '내일 오후에 리눅스 시험이 있습니다.', '2022-10-21', 1);
insert into tblNotice values (14, 'TCP/IP 강의 세부계획 안내', '10월 24일 ~ 11월 22일까지 TCP/IP 강의 예정이며 자세한 일정은 추후 공지하겠습니다.', '2022-10-22', 1);

insert into tblNotice values (15, '자바 프로젝트 안내', '7월 11일 ~ 15일 자바 프로젝트 진행 예정입니다.', '2022-07-07', 2);
insert into tblNotice values (16, '자바 프로젝트 기간 변경 안내', '15일 종료 예정이였던 프로젝트 기간이 18일로 변경되었습니다.', '2022-07-13', 2);
insert into tblNotice values (17, '자바 시험 일정 안내', '7월19일 오전에 수업 후 오후에 시험이 예정되어 있습니다.', '2022-07-15', 2);
insert into tblNotice values (18, '자바스크립트 과제 제출 안내', '구글 드라이브 자바스크립트 폴더에 과제 업로드 바랍니다.', '2022-07-20', 2);
insert into tblNotice values (19, '자바스크립트 프로젝트 & 시험 일정', '8월 11일 ~ 17일까지 자바스크립트 프로젝트 진행 후 18일에 시험이 예정되어 있습니다.', '2022-08-10', 2);
insert into tblNotice values (20, '오라클 프로젝트 안내', '오라클 프로젝트 기간: 9월 9일 ~ 15일입니다. 참고하세요.', '2022-09-06', 2);
insert into tblNotice values (21, '오라클 시험 일정 안내', '오라클 시험: 9월 16일 오후 3시입니다.', '2022-09-13', 2);
insert into tblNotice values (22, '운영체제 과제 제출 안내', '구글 드라이브의 운영체제 폴더에 과제 업로드 바랍니다.', '2022-09-19', 2);
insert into tblNotice values (23, '운영체제 시험 일정 안내', '10월 14일 시험 예정입니다.', '2022-10-11', 2);
insert into tblNotice values (24, '운영체제 시험 일정 변동 안내', '14일 예정이었던 시험이 17일로 변경되었습니다. 참고하세요.', '2022-10-12', 2);
insert into tblNotice values (25, 'Spring 강의 일정 안내', '다음시간부터 11월 16일까지 스프링 강의 예정입니다. 자세한 사항은 추후 공지하겠습니다.', '2022-10-17', 2);

insert into tblNotice values (26, '과목별 강의 일정 안내', '과목별 강의 일정을 웹페이지에 게시해놓았으니 확인바랍니다.', '2022-07-10', 3);
insert into tblNotice values (27, '오리엔테이션 안내', '내일 간단한 오리엔테이션 진행 후 수업 예정이오니 늦지 않게 참여바랍니다.', '2022-07-10', 3);
insert into tblNotice values (28, '과제 제출처 안내', '수업 중 할당되는 모든 과제는 구글 드라이브의 각 과목 폴더에 업로드 바랍니다.', '2022-07-11', 3);
insert into tblNotice values (29, '자바 프로젝트 안내', '자바 프로젝트와 관련하여 웹페이지에 게시해놓았으니 확인바랍니다.', '2022-08-04', 3);
insert into tblNotice values (30, '자바 프로젝트 발표 순서 공지 & 자바 시험 일정 안내', '자바 프로젝트 발표 순서는 웹페이지에 업로드 하였으며, 자바 시험은 11일 오후입니다.', '2022-08-09', 3);
insert into tblNotice values (31, '자바스크립트 프로젝트 안내', '자바스크립트 프로젝트와 관련하여 웹페이지에 게시해놓았으니 확인바랍니다.', '2022-08-31', 3);
insert into tblNotice values (32, '자바스크립트 시험 일정 공지', '자바스크립트 시험이 9월 4일 예정되어 있습니다.', '2022-09-02', 3);
insert into tblNotice values (33, '자바스크립트 시험 일정 변동사항 안내', '금일 예정된 자바스크립트 시험이 하루 미뤄졌으니 참고바랍니다.', '2022-09-04', 3);
insert into tblNotice values (34, 'Springframwork 프로젝트 발표 순서 공지', '프로젝트 발표 시간은 각 팀당 15분 내외이며, 발표 순서는 웹페이지에 게시해놓았습니다.', '2022-10-31', 3);

insert into tblNotice values (35, '오리엔테이션 안내', '내일 오후 4시 오리엔테이션이 예정되어 있습니다.', '2022-07-26', 4);
insert into tblNotice values (36, '과제 제출처 안내', '수업 중 할당되는 모든 과제는 구글 드라이브의 각 과목 폴더에 업로드 바랍니다.', '2022-07-29', 4);
insert into tblNotice values (37, '자바 문제 파일 공유 안내', '자바 문제 파일을 업로드 해 놓았으니 풀이 후 제출바랍니다.', '2022-08-01', 4);
insert into tblNotice values (38, '자바 프로젝트 및 시험 일정 안내', '금일 오후부터 프로젝트 진행예정이며, 시험은 26일 시행됩니다.', '2022-08-16', 4);
insert into tblNotice values (39, '자바스크립트 문제 파일 공유 안내', '자바스크립트 문제 파일을 업로드 해 놓았으니 풀이 후 제출하세요.', '2022-08-30', 4);
insert into tblNotice values (40, '자바스크립트 프로젝트 및 시험 일정 안내', '자바스크립트 프로젝트: 9/19 ~ 23, 시험: 9/26 입니다.', '2022-09-17', 4);
insert into tblNotice values (41, '오라클 설치 프로그램 안내', '오라클 설치 프로그램에 대하여 github에 설명되어있으니 참고바랍니다.', '2022-09-27', 4);
insert into tblNotice values (42, '오라클 문제 파일 공유 안내', '오라클 문제 파일을 업로드 해 놓았으니 풀이 후 구글 드라이브에 제출 바랍니다.', '2022-10-03', 4);
insert into tblNotice values (43, '오라클 강의 계획 변동 안내', '24일까지로 예정되어있던 오라클 강의가 26일까지로 변동되었습니다.', '2022-10-21', 4);
insert into tblNotice values (44, 'Python 설치 프로그램 안내', '파이썬 설치 프로그램에 관련하여 웹페이지에 업로드했으니 참고하여 설치하시길 바랍니다.', '2022-10-27', 4);

insert into tblNotice values (45, '과목별 강의 계획 안내', '과목별 강의 계획을 웹페이지에 게시해 놓았습니다. 확인하시고 참고하세요.', '2022-08-08', 5);
insert into tblNotice values (46, '과목별 시험 일정 안내', '과목별 시험 일정을 웹페이지에 게시해 놓았습니다. 확인하시고 참고하세요.', '2022-08-16', 5);
insert into tblNotice values (47, '자바 프로젝트 일정 안내', '금일부터 21일까지 자바 프로젝트 진행합니다.', '2022-09-15', 5);
insert into tblNotice values (48, '자바스크립트 프로젝트 일정 안내', '내일부터 20일까지 자바스크립트 프로젝트 진행합니다.', '2022-10-13', 5);
insert into tblNotice values (49, '오라클 강의 계획 변동 안내', '과정 첫날 공지했던 오라클 강의 계획이 변동되었습니다. 변동사항은 웹페이지를 참고하세요.', '2022-10-29', 5);
insert into tblNotice values (50, '오라클 추가 설치 파일 안내', '강의 진행 중 추가로 설치해야하는 파일을 github에 업로드 해놓았습니다.', '2022-10-28', 5);

insert into tblNotice values (51, '오리엔테이션 안내', '내일 오전 1시간정도 오리엔테이션 진행 후 수업예정입니다.', '2022-09-18', 6);
insert into tblNotice values (52, '과제 제출처 안내', '수업 중 할당되는 모든 과제는 구글 드라이브의 각 과목 폴더에 업로드 바랍니다.', '2022-09-20', 6);
insert into tblNotice values (53, '자바_연산자 문제 업로드 안내', '연산자 문제 업로드하였으니 풀어보시고 구글 드라이브에 업로드하세요~', '2022-09-21', 6);
insert into tblNotice values (54, '자바_메소드 문제 업로드 ', '메소드 문제 업로드하였으니 풀어보시고 구글 드라이브에 업로드하세요~', '2022-09-30', 6);
insert into tblNotice values (55, '자바_조건문 문제 업로드', '조건문 문제 업로드하였으니 풀어보시고 구글 드라이브에 업로드하세요~', '2022-10-05', 6);
insert into tblNotice values (56, '자바_반복문 문제 업로드', '반복문 문제 업로드하였으니 풀어보시고 구글 드라이브에 업로드하세요~', '2022-10-10', 6);
insert into tblNotice values (57, '자바_배열 문제 업로드', '배열 문제 업로드하였으니 풀어보시고 구글 드라이브에 업로드하세요~', '2022-10-13', 6);
insert into tblNotice values (58, '자바_클래스 문제 업로드', '클래스 문제 업로드하였으니 풀어보시고 구글 드라이브에 업로드하세요~', '2022-10-17', 6);
insert into tblNotice values (59, '자바_컬렉션 문제 업로드', '컬렉션 문제 업로드하였으니 풀어보시고 구글 드라이브에 업로드하세요~', '2022-10-19', 6);
insert into tblNotice values (60, '자바 프로젝트 일정 안내', '10월 20일부터 28일까지 자바 프로젝트 진행예정입니다.', '2022-10-19', 6);
insert into tblNotice values (61, '자바 프로젝트 팀 구성 안내', '프로젝트 팀 구성을 웹페이지에 게시하였으니 확인하시길 바랍니다.', '2022-10-20', 6);
insert into tblNotice values (62, '자바 프로젝트 발표 공지', '프로젝트 발표는 각 팀당 20분내외로 제한하며, 발표 순서는 발표 당일에 공지하겠습니다.', '2022-10-27', 6);
insert into tblNotice values (63, '자바 시험 일정 안내', '10월 31일 오전에 자바 시험이 예정되어있으니 늦지 않게 참여바랍니다.', '2022-10-28', 6);
insert into tblNotice values (64, '자바 시험 시간 변동 안내', '오전에 강의 진행으로 시험 시간이 오후로 변동되었습니다.', '2022-10-28', 6);
insert into tblNotice values (65, '자바스크립트 강의 계획 안내', '다음시간부터 29일까지 자바스크립트 강의예정입니다.', '2022-10-31', 6);


--set define on;

select * from tblNotice;